{"intents": [
        {"tag": ["Limit Alcohol Intake"],
         "patterns": ["1"],
         "responses": ["Tip description: ",
         "Limiting alcohol consumption can improve health and reduce the risk of liver disease.",
         "Scientific Backing: ",
         "Excessive alcohol intake is linked to liver disease, certain cancers, and cardiovascular problems."],
         "context_set": ""
        },

        {"tag": ["Avoid Smoking"],
         "patterns": ["2"],
         "responses": ["Tip Description: ",
         "Avoiding smoking can significantly improve overall health.",
         "Scientific Backing: ",
         "Quitting smoking lowers the risk of developing lung cancer, heart disease, and experiencing a stroke."],
         "context_set": ""
        },

        {"tag": ["Healthy Weight Management"],
         "patterns": ["3"],
         "responses": ["Tip Description: ",
         "Maintaining a healthy weight reduces the risk of chronic diseases.",
         "Scientific Backing: ",
         "Healthy weight management is associated with lower risks of heart disease, diabetes, and certain cancers."],
         "context_set": ""
        },

        {"tag": ["Stay Hydrated"],
         "patterns": ["4"],
         "responses": ["Tip Description: ",
         "Drinking enough water daily is essential for maintaining overall health",
         "Scientific Backing: ",
         "Water is crucial for regulating body temperature, lubricating joints, and safeguarding delicate tissues. As well as helping cognitive function for brain function. "],
         "context_set": ""
        },

        {"tag": ["Have Adequate Sleep"],
         "patterns": ["5"],
         "responses": ["Tip Description: ",
         "Aim for 7-9 hours of quality sleep each night to support your overall health and well-being.",
         "Scientific Backing: ",
         "Adequate sleep helps regulate mood, improve cognitive function, and support physical health. It reduces the risk of chronic conditions such as heart disease, diabetes, and high blood pressure."],
         "context_set": ""
        },

        {"tag": ["Wear Sunscreen"],
         "patterns": ["6"],
         "responses": ["Tip Description: ",
         "Use sunscreen and wear protective clothing to shield your skin from UV rays.",
         "Scientific Backing: ",
         "Protecting your skin from UV radiation reduces the risk of skin cancer and prevents premature aging. Studies show that regular use of sunscreen can significantly lower the incidence of skin cancer."],
         "context_set": ""
        },

        {"tag": ["Hand Hygiene"],
         "patterns": ["7"],
         "responses": ["Tip Description: ",
         "Teach children to wash their hands regularly, especially before eating and after using the bathroom.",
         "Scientific Backing: ",
         "Good hand hygiene helps prevent the spread of infections and illnesses."],
         "context_set": ""
        },

        {"tag": ["Mental Health Awareness"],
         "patterns": ["8"],
         "responses": ["Tip Description: ",
         "Encourage open communication about feelings and provide emotional support.",
         "Scientific Backing: ",
         "Good mental health practices can reduce stress, improve relationships, and enhance overall well-being."],
         "context_set": ""
        },

        {"tag": ["Regular Physical Activity"],
         "patterns": ["9"],
         "responses": ["Tip Description: ",
         "Make physical activity a fun family activity, like playing outside, going for walks, or dancing together.",
         "Scientific Backing: ",
         "Regular exercise improves cardiovascular health, strengthens muscles, and enhances mood."],
         "context_set": ""
        },

        {"tag": ["Limit Screen Time"],
         "patterns": ["10"],
         "responses": ["Tip Description: ",
         "Set limits on screen time and encourage other activities like reading, playing, and outdoor fun.",
         "Scientific Backing: ",
         "Reducing screen time can improve sleep quality, physical health, and social interactions."],
         "context_set": ""
        }
   ]
}
